#pragma once

// SDKDDKVer.h를 포함하면 최고 수준의 가용성을 가진 Windows 플랫폼이 정의됩니다.

// 이전 Windows 플랫폼에 대해 응용 프로그램을 빌드하려는 경우에는 SDKDDKVer.h를 포함하기 전에
// WinSDKVer.h를 포함하고 _WIN32_WINNT 매크로를 지원하려는 플랫폼으로 설정하십시오.

#include <SDKDDKVer.h>

// 해야할 일

// 170611 NPC ( 물건 구입 및 퀘스트 창 )

// !!!!! 스킬 매니저 ( 데미지 등등 전부 넣어야함;; )

// UI매니저 추가

// 플레이어 이미지

// 에이스타

// z오더 ( 에너미 npc 플레이어 간 z오더 ) 이거 너무 어렵네

// 각 매니저 연동

// 플레이어 캐릭터 생성 및 데이터 세이브 로드 
// ( 마지막 위치, 어떤 맵인지, 스탯, 무슨 아이템을 들고있는지,무슨 스킬을 찍었는지, 무슨 아이템이 장착되어 있는지 등등 전부

// 미니맵

// 로딩씬 만든후 이미지 및 사운드 적재

//
// 

// 플레이어가 스킬 포인터를 들고있고 그 포인터를 통해 직접 그 스킬로 접근하여 랜더
// 

// 효과음 버튼 충돌 사운드 수정


// 아이템 폰트 꾸미기 - > 

// 
// 

// 
// 

// 
// 

// 
// 방향 -> 좌표로 수정

// 플레이어 데이터를 가져오는거까지는 어떻게 했는데 인벤토리랑 장비창이랑 스킬창이 막히네;;

// 물건 되파는 기능

// 몬스터 때렸을 때 몬스터 hp랑 정보 창

// 몬스터 때리거나 맞았을 때 사운드

// 로딩씬 적재

// 동영상

// 버클러 함수 수정해야하는데 할수 있을까...

// 퀵슬롯

// 캐릭터 삭제